app/Modules/Sidang/Controllers/AdminSetupController.php

SELECT *
FROM `sidang_admins`
---
    public function setupIndex()
    {
        $listAdmins = $this->sidangAdminModel->findAll();

SELECT *
FROM `sidang_admins`
WHERE `sidang_admins`.`id` = 1
---
    public function generateQr($id)
    {
        $adminUser = $this->sidangAdminModel->find($id);