app/Libraries/Settings.php

SELECT *
FROM `settings`
---
	public function __construct()
	{
		$DB = \Config\Database::connect();
		$site = $DB->table('settings');

		foreach($site->get()->getResult() as $set){